/**
 * 五大链接
 */
var fiveSystemList = [
  {
    title: '统一身份认证平台',
    subtitle: '',
    icon: 'static/img/head01.png',
    link: 'http://',
    top: 395,
    left: 344,
  },
  {
    title: '数字资源管理平台',
    subtitle: '',
    icon: 'static/img/head02.png',
    link: 'http://',
    top: 395,
    left: 1028,
  },
  {
    title: '一体化气象数据仓',
    subtitle: '',
    icon: 'static/img/head03.png',
    link: 'http://',
    top: 580,
    left: 364,
  },
  {
    title: '人工智能与区块链',
    subtitle: '',
    icon: 'static/img/head04.png',
    link: 'http://',
    top: 580,
    left: 1028,
  },
  {
    title: '天擎',
    subtitle: '',
    icon: 'static/img/head05.png',
    link: 'http://',
    top: 650,
    left: 720,
  },
]

/**
 * 其他链接 - 底部
 */
var otherSystemList = [
  {
    title: '',
    link: 'http://',
    icon: 'static/img/link-bg.png',
  },
  {
    title: '',
    link: 'http://',
    icon: 'static/img/link-bg.png',
  },
  {
    title: '',
    link: 'http://',
    icon: 'static/img/link-bg.png',
  },
]

/**
 * 天擎气象大数据云平台
 */
var tqList = [
  {
    title: '数据服务',
    nums: [14, 563],
    units: ['类', '种'],
    icon: 'static/img/01.png',
  },
  {
    title: '算法服务',
    nums: [16, 174],
    units: ['类', '种'],
    icon: 'static/img/02.png',
  },
];
var interfaceList = [
  {
    title: '降水实况',
    num: '92830',
  },
  {
    title: '反射率拼图',
    num: '92830',
  },
  {
    title: 'FY4卫星云图',
    num: '92830',
  },
  {
    title: '数值预报',
    num: '92830',
  },
  {
    title: '气象灾害汇总',
    num: '92830',
  },
]

/**
 * 人工智能与区块链概况
 */
var aiList = [
  {
    title: '项目数量',
    num: 216,
    unit: '个',
    icon: 'static/img/03.png',
  },
  {
    title: '算法模型',
    num: 84,
    unit: '个',
    icon: 'static/img/04.png',
  },
  {
    title: '知识库',
    num: 7,
    unit: '个',
    icon: 'static/img/05.png',
  },
  {
    title: '数据总量',
    num: 216,
    unit: 'GB',
    icon: 'static/img/06.png',
  },
];

/**
 * 应用开放平台
 */
var appList = [
  {
    title: '地图服务',
    num: 8216,
    unit: '核',
    icon: 'static/img/01.png',
  },
  {
    title: '数据服务',
    num: 7084,
    unit: '核',
    icon: 'static/img/02.png',
  },
  {
    title: '组件服务',
    num: 8216,
    unit: '核',
    icon: 'static/img/07.png',
  },
  {
    title: '上线应用',
    num: 8216,
    unit: '核',
    icon: 'static/img/08.png',
  },
];

/**
 * 算法管理平台
 */
var algList = [
  {
    title: '算法数量',
    num: 8216,
    unit: '核',
    icon: 'static/img/09.png',
  },
  {
    title: '任务数量',
    num: 7084,
    unit: '核',
    icon: 'static/img/10.png',
  },
  {
    title: '接口数量',
    num: 8216,
    unit: '核',
    icon: 'static/img/11.png',
  },
];

/**
 * 统一身份认证平台
 */
var identifyList = [
  {
    title: '用户总数',
    num: 8216,
    unit: '核',
    icon: 'static/img/12.png',
  },
  {
    title: '日活数',
    num: 7084,
    unit: '核',
    icon: 'static/img/14.png',
  },
  {
    title: '支撑系统',
    num: 8216,
    unit: '核',
    icon: 'static/img/13.png',
  },
];


/**
 * 行政区划
 */
var cityCodeMap = {
  '杭州市': '330100000',
  '宁波市': '330200000',
  '温州市': '330300000',
  '绍兴市': '330600000',
  '湖州市': '330500000',
  '嘉兴市': '330400000',
  '金华市': '330700000',
  '衢州市': '330800000',
  '台州市': '331000000',
  '丽水市': '331100000',
  '舟山市': '330900000'
};
var countyMap = {
  '杭州市': [
      {'上城区': '330102000'},
      {'拱墅区': '330105000'},
      {'西湖区': '330106000'},
      {'滨江区': '330108000'},
      {'余杭区': '330110000'},
      {'萧山区': '330109000'},
      {'富阳区': '330111000'},
      {'临安区': '330112000'},
      {'建德市': '330182000'},
      {'桐庐县': '330122000'},
      {'淳安县': '330127000'}
  ],
  '宁波市': [
      {'海曙区': '330203000'},
      {'江北区': '330205000'},
      {'北仑区': '330206000'},
      {'镇海区': '330211000'},
      {'鄞州区': '330212000'},
      {'奉化区': '330213000'},
      {'余姚市': '330281000'},
      {'慈溪市': '330282000'},
      {'象山县': '330225000'},
      {'宁海县': '330226000'}
  ],
  '温州市': [
      {'鹿城区': '330302000'},
      {'龙湾区': '330303000'},
      {'瓯海区': '330304000'},
      {'洞头区': '330305000'},
      {'瑞安市': '330381000'},
      {'乐清市': '330382000'},
      {'永嘉县': '330324000'},
      {'平阳县': '330326000'},
      {'苍南县': '330327000'},
      {'文成县': '330328000'},
      {'泰顺县': '330329000'},
      {'龙港市': '330383000'}
  ],
  '绍兴市': [
      {'越城区': '330602000'},
      {'柯桥区': '330603000'},
      {'上虞区': '330604000'},
      {'诸暨市': '330681000'},
      {'嵊州市': '330683000'},
      {'新昌县': '330624000'}
  ],
  '湖州市': [
      {'吴兴区': '330502000'},
      {'南浔区': '330503000'},
      {'德清县': '330521000'},
      {'长兴县': '330522000'},
      {'安吉县': '330523000'}
  ],
  '嘉兴市': [
      {'南湖区': '330402000'},
      {'秀洲区': '330411000'},
      {'海宁市': '330481000'},
      {'平湖市': '330482000'},
      {'桐乡市': '330483000'},
      {'嘉善县': '330421000'},
      {'海盐县': '330424000'}
  ],
  '金华市': [
      {'婺城区': '330702000'},
      {'金东区': '330703000'},
      {'兰溪市': '330781000'},
      {'东阳市': '330783000'},
      {'永康市': '330784000'},
      {'义乌市': '330782000'},
      {'武义县': '330723000'},
      {'浦江县': '330726000'},
      {'磐安县': '330727000'}
  ],
  '衢州市': [
      {'柯城区': '330802000'},
      {'衢江区': '330803000'},
      {'江山市': '330822000'},
      {'常山县': '330824000'},
      {'开化县': '330825000'},
      {'龙游县': '330881000'}
  ],
  '台州市': [
      {'椒江区': '331002000'},
      {'黄岩区': '331003000'},
      {'路桥区': '331004000'},
      {'临海市': '331082000'},
      {'温岭市': '331081000'},
      {'玉环市': '331083000'},
      {'三门县': '331022000'},
      {'天台县': '331023000'},
      {'仙居县': '331024000'}
  ],
  '丽水市': [
      {'莲都区': '331102000'},
      {'龙泉市': '331181000'},
      {'青田县': '331121000'},
      {'缙云县': '331122000'},
      {'遂昌县': '331123000'},
      {'松阳县': '331124000'},
      {'云和县': '331125000'},
      {'庆元县': '331126000'},
      {'景宁畲族自治县': '331127000'}
  ],
  '舟山市': [
      {'定海区': '330902000'},
      {'普陀区': '330903000'},
      {'岱山县': '330921000'},
      {'嵊泗县': '330922000'}
  ]
};
